Revit 2024 API
BuiltInFailures.AutoRouteFailures.NoFittingInRoutingError Property
 The fitting that is converted to was not defined. Please assign one in the routing preference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoFittingInRoutingError { get; }
Visual Basic
Public Shared ReadOnly Property NoFittingInRoutingError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoFittingInRoutingError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace